{"title":"How major German firms like Mercedes and Lufthansa are using NFTs","type":"article","url":"https://www.bitcoininsider.org/article/230877/how-major-german-firms-mercedes-and-lufthansa-are-using-nfts","image":"https://www.bitcoininsider.org/themes/custom/mytheme/images/bitcoininsider-logo-social-1200x630.png","image_secure_url":null,"image_type":null,"image_width":"1200","image_height":null,"image_alt":null,"video":null,"video_secure_url":null,"video_type":null,"video_width":"630","video_height":null,"audio":null,"audio_secure_url":null,"audio_type":null,"description":"German brands embrace NFTs, exploring new ways to engage with customers and build brand loyalty. For the most part, nonfungible tokens (NFTs) have two primary use cases: Buying and selling digital products (digital art, virtual fashion items) and building digital communities (exclusive memberships, access to events).  These use cases can be easily adopted by brands and companies, such as fashion brands selling digital clothes, various companies offering NFT-based club memberships and musicians holding exclusive concerts for their fans. Traditional German companies are also jumping on the bandwagon, recognizing the potential of NFT technology to innovate and market their products and services. Deutsche Post combines NFTs and AI Deutsche Post, the German postal service, will release its first limited-edition collectible stamp on Nov. 2, 2023. A classic self-adhesive stamp will come with a digital image — an NFT representing ownership of the stamp. The first stamp features a pixellated image of the Brandenburg Gate generated by artificial intelligence (AI). Upcoming stamps in the collection will feature other iconic German landmarks. It remains to be seen whether the NFT stamp collection will be a commercial success. However, it is a significant step for Deutsche Post, which is looking to expand its reach into the digital world. Erste offizielle Deutschland-#Krypto-#Briefmarke kommt. Mehr: https://t.co/IqcouOeygG pic.twitter.com/XS4y5nkFCo — Deutsche Post und DHL News (@DeutschePostDHL) October 12, 2023 Lufthansa takes to the skies with NFT art NFTs can also be used for various loyalty programs, offering customers a more rewarding and engaging experience while providing businesses with a new way to connect with their customers and build brand loyalty.  An example of such a program is Lufthansa’s NFT loyalty program on the Polygon network. In collaboration with Lufthansa Innovation Hub and Miles & More, its frequent flyer program, Lufthansa has developed the Uptrip mobile application that allows passengers to turn their travel experiences into NFTs. These NFTs can then be redeemed for rewards such as mileage bonuses and business lounge vouchers. Lufthansa's @Uptrip_app loyalty program is building #onPolygon to turn flights into rewardsCollect NFT trading cards for every flight and claim rewardsLearn more about the new Miles & More and @LHInnovationHub experience: https://t.co/MjQihK8xUx pic.twitter.com/JfUEoUJxNR — Polygon (Labs) (@0xPolygonLabs) August 31, 2023 According to Christopher Siegloch, head of program development and services at Miles & More, the app has already generated significant interest among Lufthansa customers. Since its launch, over 20,000 users have registered, and more than 200,000 collectible cards have been issued. Siegloch highlights that gamification elements play a crucial role in introducing participants to Web3 technologies like NFTs, and the app successfully translates the enthusiasm for collecting into the digital realm. Furthermore, in the second half of 2023, the app will introduce a digital marketplace where users can trade and sell their NFTs, with special NFT reward offers planned for the future. Adidas and Hugo Boss reimagine fashion NFTs are also reaching out to fashion brands. For example, German apparel company Adidas continues to refine its Web3 strategy by actively using NFTs to find new ways to engage with its community of athletes, sneakerheads and sports enthusiasts.  Recently, Adidas introduced a series of limited-edition NFT sneakers inspired by their iconic footwear designs. These digital sneakers can be showcased in virtual environments, allowing users to express their love for the brand in the metaverse. Recent: How Google’s AI legal protections can change art and copyright protections Adidas is also discovering new ways to use the full potential of NFT to encourage its community. The last example is The Adidas /// Studio, or Triple Stripes Studio, which launched a Web3-based digital artist-in-residency program to showcase and support budding creators in the NFT space. According to Adidas, the goal is to support and nurture creative talents in the digital realm, providing artists with an opportunity to showcase their work and collaborate with the sportswear giant. This collaboration extends beyond digital projects and may include physical products in the future. Another German fashion brand, Hugo Boss, has also entered the NFT arena with a focus on fashion in the metaverse. The company collaborated with renowned digital fashion designers to create a series of exclusive NFT clothing items. These digital fashion pieces can be worn by avatars in virtual worlds, allowing users to dress in style even in the digital realm. Mercedez-Benz digitalized its history Mercedes-Benz boasts a rich history spanning more than 130 years, attracting a dedicated following of nostalgia enthusiasts and collectors. The brand’s iconic models, vintage cars and related artifacts, whether in their original form or as miniature models and toys, continue to hold appeal. In line with its strategic direction, the German automaker is venturing into the Web3 space through the launch of Mercedes-Benz NXT to enhance its engagement with the community. In September, Mercedes-Benz launched its third NFT collection: The Era of Luxury. These collectibles created by Mercedes-Benz NXT Icons are digital reinterpretations of the most remarkable designs from seven design eras. The collection spans from the present day to the early history of automobiles. 1/ What a fantastic reveal on Wednesday! In this thread, we would like to show you a selection of combinations of the Mercedes-Benz NXT Icons from “The Era of Luxury”. Let us start with Mercedes-Benz NXT Icons #41 collected by Pakwalker. ↓ pic.twitter.com/ogyubfA9M8 — Mercedes-Benz NXT (@MercedesBenzNXT) September 29, 2023 All three NFT collections show how Mercedes-Benz actively explores opportunities to blend the digital realm with automotive design. This endeavor is spearheaded by the brand’s chief design officer, Gorden Wagener, who guides the Mercedes-Benz design team in creating digital collectibles. The primary objective is to reinterpret the brand’s most iconic designs, presenting them in the digital format of NFT cards.  Ritter Sport, Haribo and Katjes create sweet NFTs Ritter Sport, a German chocolate brand, also ventured into the NFT world by launching a limited series of digital chocolate bars as NFTs in August 2023. The NFT collection is called Art of the Square and consists of 256 digital pixel art pieces, each depicting a square Ritter Sport bar. gm! Ganz im Sinne von Clara Ritter haben wir eine Kollektion an Digital Collectibles entworfen: „Art of the square“ geht am 23.08. um 16 Uhr in den Verkauf, die Allowlist ist schon online! Hier entlang: https://t.co/oSYzlJqKb8 & https://t.co/WnzbYI3c71#web3 #digitalart #hodl pic.twitter.com/9gIEcKpkNe — ClaraRitter.eth (@clararittereth) August 9, 2023 Not only Ritter Sport uses such creative marketing strategies to engage with a tech-savvy audience. Other German food brands have also released their NFT collections. For example, confectioner Katjes released its NFT collection of three unicorn babies named Dash, Willow and Sparkles in April 2023.  This was Katjes’ second NFT campaign after releasing a limited-edition collection of 777 unicorn NFTs in May 2022. Both campaigns were a way for Katjes to reach a younger audience, as unicorn babies are a popular character among children and teenagers. Magazine: Ethereum restaking: Blockchain innovation or dangerous house of cards? Haribo, a German confectionery company famous for its gummy bears, has also entered the NFT world. In April 2023, the company filed for NFT trademarks in the United States, indicating its plans to expand its brand into the digital world. The trademarks cover a wide range of digital assets, including digital avatars, multimedia files with confectionery-related artwork, cartoons and other items authenticated by NFTs. German confectionery company #HARIBO has registered its name as a trademark for: ✅ Smartwatches ✅ VR Glasses ✅ Media verified by NFTs ✅ Jewelry and Toys... and much more!#NFT #MetaverseNFT #GoldBears #Trademark #Candy #NFTs #VR pic.twitter.com/y7WqNVJC7c — Mike Kondoudis (@KondoudisLaw) April 26, 2023 Adidas, Haribo, Lufthansa, Deutsche Post and other traditional German brands have joined the growing list of businesses venturing into the NFT space. This expansion marks a significant shift in the perception of NFTs, as they are no longer viewed solely as a niche investment opportunity.  Instead, NFTs are increasingly being seen as a mainstream marketing tool and a way to experiment with new concepts that bridge the virtual and physical worlds and build new communities.","determiner":null,"locale":null,"locale_alternate":null,"site_name":"Bitcoin Insider","domain":"www.bitcoininsider.org"}